n5/src/Documents/Meeting/Meeting.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Meeting</name>
  <posting>Deny</posting>
  <attributes>
    <name>Canceled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Changed</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Changes</name>
    <type>
      <types>DefinedType.MeetingComment</types>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Completed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Formed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Notify</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Reason</name>
    <type>
      <types>DefinedType.MeetingComment</types>
    </type>
  </attributes>
  <attributes>
    <name>Room</name>
    <type>
      <types>CatalogRef.Rooms</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Members</name>
    <attributes>
      <name>Member</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Organizer</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Send</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Documents/Meeting/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkDoubles () ) then
		Cancel = true;
	endif;
	if ( not checkPeriod () ) then
		Cancel = true;
	endif;
	if ( Cancel ) then
		return;
	endif;
	if ( not roomAvailable () ) then
		Cancel = true;
	endif;
	
EndProcedure

Function checkDoubles ()
	
	doubles = Collections.GetDoubles ( Members, "Member" );
	if ( doubles.Count () > 0 ) then
		for each row in doubles do
			Output.DoubleParticipants ( , Output.Row ( "Members", row.LineNumber, "Member" ) );
		enddo; 
		return false;
	endif; 
	return true;
	
EndFunction 

Function checkPeriod ()
	
	if ( not Periods.Ok ( Start, Finish ) ) then
		Output.PeriodError ( , "Finish" );
		return false;
	endif; 
	if ( Start < CurrentSessionDate () ) then
		Output.MeetingExpired ( , "Start" );
		return false;
	endif; 
	return true;
	
EndFunction

Function roomAvailable ()
	
	SetPrivilegedMode ( true );
	data = getReservation ();
	if ( data = undefined ) then
		return true;
	endif;
	meeting = data.Ref;
	Output.RoomOccupied ( new Structure ( "Meeting", meeting ), , meeting );
	return false;
	
EndFunction

Function getReservation ()
	
	s = "
	|// @Data
	|select top 1 Meetings.Ref as Ref
	|from Document.Meeting as Meetings
	|where Meetings.Ref <> &Ref
	|and Meetings.Room = &Room
	|and Meetings.Formed
	|and not Meetings.Completed
	|and ( Meetings.Start between &Start and &Finish
	|	or Meetings.Finish between &Start and &Finish )
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	q.SetParameter ( "Room", Room );
	q.SetParameter ( "Start", Start );
	q.SetParameter ( "Finish", Finish );
	return SQL.Exec ( q ).Data;
	
EndFunction

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif;
	if ( DeletionMark
		and stillActive () ) then
		Cancel = true;
	endif;
	
EndProcedure

Function stillActive ()
	
	if ( Formed and not Canceled ) then
		Output.MeetingShouldBeCanceled ();
		return true;
	else
		return false;
	endif;
	
EndFunction

#endif
